#1

# Напишите код который создает пирамиду
# из звездочек

#2

# напишите код который выводит площадь треугольника

#3

# создайте калькулятор которая передает ответы на другой файл но если файл отсутвует выводит "файл не найден или отсутвует"

#4

# напишите класс которая создает файл и закидывает туда все заданное

#5

# напишите код
# которое запрашивает у пользователя имя пользователя а так же пароль и сравнивает его с тем которое уже сущетвует
print('hi')
print(ddd)